app/controllers/doctors_controller.rb

 def update
    @doctor = Doctor.find(params[:id])
    @doctor.update(name: params[:name], department: params[:department])
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "doctors" SET "name" = $1, "department" = $2, "updated_at" = $3 WHERE "doctors"."id" = $4  [["name", "targerian"], ["department", nil], ["updated_at", "2021-07-21 07:16:27.580594"], ["id", 10]]

  def destroy
     @doctor = Doctor.destroy(params[:id])
---
DELETE FROM "doctors" WHERE "doctors"."id" = $1  [["id", 14]]

  def edit
    @doctor = Doctor.where(id: params[:id]).first
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 ORDER BY "doctors"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def show
    @doctor = Doctor.where(id: params[:id]).first
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 ORDER BY "doctors"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @doctor = Doctor.create(name: params[:Name], department: params[:department])
---
INSERT INTO "doctors" ("name", "department", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "oo"], ["department", "5"], ["created_at", "2021-07-19 12:54:38.404574"], ["updated_at", "2021-07-19 12:54:38.404574"]]