app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "chechu kuttiiii"], ["updated_at", "2021-08-17 16:07:26.080926"], ["id", 21]]
---
  def update
    @user = User.find(params[:id])
    @user.update(name: params[:name], age: params[:age])

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]
---
  def destroy
     @user = User.destroy(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @user = User.where(id: params[:id]).first

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def search
    @users = User.where("mail_id ILIKE ? or name ILIKE ?" , "%#{params[:query]}%", "%#{params[:query]}%")

INSERT INTO "users" ("name", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Aarya"], ["age", 3], ["created_at", "2021-07-21 09:55:13.011077"], ["updated_at", "2021-07-21 09:55:13.011077"]]
---
  def create
    # logic
    @user = User.create(name: params[:name], age: params[:age])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @user = User.where(id: params[:id]).first